#include "configuration.h"
const uint8_t _DAC_GROUP_X_NUM[_cfg_DAC_GROUP_NUM] = {2,2,2,2};

//功放的分组（注意!不是线圈的分组）
const uint8_t _cfg_Group_of_DAC[_cfg_DAC_GROUP_NUM][2] = {{1,5},{2,7},{3,6},{4,8}};

//功放编号 与 线圈的对应关系（以及电流方向）
const uint8_t _cfg_DAC_number_To_coil_number[_cfg_DAC_CHANNEL_NUM][2] = 
//功放：1,     2,     3,      4,       5,      6,          7,      8
    {{1,5}, {2,6},  {3,7},  {4,8},  {9,10}, {11,12},    {13,14},{15,16}};

//与上面线圈编号一一对应的电流方向
const int8_t _cfg_Directions[_cfg_DAC_CHANNEL_NUM][2] =                 
    {{1,-1},{0,0},  {1,-1}, {1,-1}, {1,1},  {1,1},      {1,1},  {1,1}};

//各功放使能/不使能。注意使能不使能与directions不为0为0要对应。
const uint8_t _cfg_ENABLE_DAC[_cfg_DAC_CHANNEL_NUM] = 
    {  1,     0,      1,      1,      1,      1,          1,      1};

const _unit_MAIN_PID_DATA _cst_COIL_POSITION[3*_cfg_COIL_NUM] = 
{
    0.037,0.02616295,0.0,-0.02616295,-0.037,-0.02616295,0.0,0.02616295,0.03021037,0.02136196,0.0,-0.02136196,-0.03021037,-0.02136196,0.0,0.02136196,
    0.0,0.02616295,0.037,0.02616295,0.0,-0.02616295,-0.037,-0.02616295,0.0,0.02136196,0.03021037,0.02136196,0.0,-0.02136196,-0.03021037,-0.02136196,
    0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,-0.02136196,-0.02136196,-0.02136196,-0.02136196,-0.02136196,-0.02136196,-0.02136196,-0.02136196
};

/**** Copyright (C)2018 Ventus Guo. All Rights Reserved **** END OF FILE ****/
